dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/GPIOC_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="GPIOC" HW_revision="1.0">
    <register id="GPIOC_FSUB_0" width="32" offset="0x400" description="Subsciber Port 0">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <register id="GPIOC_FSUB_1" width="32" offset="0x404" description="Subscriber Port 1">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <register id="GPIOC_FPUB_0" width="32" offset="0x444" description="Publisher Port 0">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <register id="GPIOC_FPUB_1" width="32" offset="0x448" description="Publisher Port 1">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <group id="GPIOC_GPRCM" name="GPIOC_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="GPIOC_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="GPIOC_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="GPIOC_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
        </group>
    <register id="GPIOC_CLKOVR" width="32" offset="0x1010" description="Clock Override">
        <bitfield id="OVERRIDE" description="Unlocks the functionality of [RUN_STOP] to override the automatic peripheral clock request" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLED" value="0x0" description="Override disabled"/>
            <bitenum id="ENABLED" value="0x1" description="Override enabled"/>
        </bitfield>
        <bitfield id="RUN_STOP" description="If [OVERRIDE] is enabled, this register is used to manually control the peripheral's clock request to the system" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="RUN" value="0x0" description="Run/ungate functional clock"/>
            <bitenum id="STOP" value="0x1" description="Stop/gate functional clock"/>
        </bitfield>
    </register>
    <register id="GPIOC_PDBGCTL" width="32" offset="0x1018" description="Peripheral Debug Control">
        <bitfield id="FREE" description="Free run control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted."/>
            <bitenum id="RUN" value="0x1" description="The peripheral ignores the state of the Core Halted input"/>
        </bitfield>
    </register>
    <group id="GPIOC_CPU_INT" name="GPIOC_CPU_INT" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="GPIOC_CPU_INT_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No bit is set means there is no pending interrupt request"/>
                <bitenum id="DIO0" value="0x1" description="DIO0 interrupt"/>
                <bitenum id="DIO1" value="0x2" description="DIO1 interrupt"/>
                <bitenum id="DIO2" value="0x3" description="DIO2 interrupt"/>
                <bitenum id="DIO3" value="0x4" description="DIO3 interrupt"/>
                <bitenum id="DIO4" value="0x5" description="DIO4 interrupt"/>
                <bitenum id="DIO5" value="0x6" description="DIO5 interrupt"/>
                <bitenum id="DIO6" value="0x7" description="DIO6 interrupt"/>
                <bitenum id="DIO7" value="0x8" description="DIO7 interrupt"/>
                <bitenum id="DIO8" value="0x9" description="DIO8 interrupt"/>
                <bitenum id="DIO9" value="0xA" description="DIO9 interrupt"/>
                <bitenum id="DIO10" value="0xB" description="DIO10 interrupt"/>
                <bitenum id="DIO11" value="0xC" description="DIO11 interrupt"/>
                <bitenum id="DIO12" value="0xD" description="DIO12 interrupt"/>
                <bitenum id="DIO13" value="0xE" description="DIO13 interrupt"/>
                <bitenum id="DIO14" value="0xF" description="DIO14 interrupt"/>
                <bitenum id="DIO15" value="0x10" description="DIO15 interrupt"/>
                <bitenum id="DIO16" value="0x11" description="DIO16 interrupt"/>
                <bitenum id="DIO17" value="0x12" description="DIO17 interrupt"/>
                <bitenum id="DIO18" value="0x13" description="DIO18 interrupt"/>
                <bitenum id="DIO19" value="0x14" description="DIO19 interrupt"/>
                <bitenum id="DIO20" value="0x15" description="DIO20 interrupt"/>
                <bitenum id="DIO21" value="0x16" description="DIO21 interrupt"/>
                <bitenum id="DIO22" value="0x17" description="DIO22 interrupt"/>
                <bitenum id="DIO23" value="0x18" description="DIO23 interrupt"/>
                <bitenum id="DIO24" value="0x19" description="DIO24 interrupt"/>
                <bitenum id="DIO25" value="0x1A" description="DIO25 interrupt"/>
                <bitenum id="DIO26" value="0x1B" description="DIO26 interrupt"/>
                <bitenum id="DIO27" value="0x1C" description="DIO27 interrupt"/>
                <bitenum id="DIO28" value="0x1D" description="DIO28 interrupt"/>
                <bitenum id="DIO29" value="0x1E" description="DIO29 interrupt"/>
                <bitenum id="DIO30" value="0x1F" description="DIO30 interrupt"/>
                <bitenum id="DIO31" value="0x20" description="DIO31 interrupt"/>
            </bitfield>
        </register>
        <register id="GPIOC_CPU_INT_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="DIO0" description="DIO0 event mask" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO1" description="DIO1 event mask" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO2" description="DIO2 event mask" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO3" description="DIO3 event mask" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO4" description="DIO4 event mask" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO5" description="DIO5 event mask" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO6" description="DIO6 event mask" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO7" description="DIO7 event mask" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO8" description="DIO8 event mask" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO9" description="DIO9 event mask" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO10" description="DIO10 event mask" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO11" description="DIO11 event mask" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO12" description="DIO12 event mask" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO13" description="DIO13 event mask" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO14" description="DIO14 event mask" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO15" description="DIO15 event mask" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO16" description="DIO16 event mask" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO17" description="DIO17 event mask" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO18" description="DIO18 event mask" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO19" description="DIO19 event mask" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO20" description="DIO20 event mask" begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO21" description="DIO21 event mask" begin="21" end="21" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO22" description="DIO22 event mask" begin="22" end="22" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO23" description="DIO23 event mask" begin="23" end="23" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO24" description="DIO24 event mask" begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO25" description="DIO25 event mask" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO26" description="DIO26 event mask" begin="26" end="26" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO27" description="DIO27 event mask" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO28" description="DIO28 event mask" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO29" description="DIO29 event mask" begin="29" end="29" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO30" description="DIO30 event mask" begin="30" end="30" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO31" description="DIO31 event mask" begin="31" end="31" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
        </register>
