dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/GPIOC_1.0.xml
    <register id="GPIOC_DOUT15_12" width="32" offset="0x120C" description="Data output 15 to 12">
        <bitfield id="DIO12" description="This bit sets the value of the pin configured as DIO12 when the output is enabled through DOE31_0 register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO13" description="This bit sets the value of the pin configured as DIO13 when the output is enabled through DOE31_0 register." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO14" description="This bit sets the value of the pin configured as DIO14 when the output is enabled through DOE31_0 register." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO15" description="This bit sets the value of the pin configured as DIO15 when the output is enabled through DOE31_0 register." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
    </register>
    <register id="GPIOC_DOUT19_16" width="32" offset="0x1210" description="Data output 19 to 16">
        <bitfield id="DIO16" description="This bit sets the value of the pin configured as DIO16 when the output is enabled through DOE31_0 register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO17" description="This bit sets the value of the pin configured as DIO17 when the output is enabled through DOE31_0 register." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO18" description="This bit sets the value of the pin configured as DIO18 when the output is enabled through DOE31_0 register." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO19" description="This bit sets the value of the pin configured as DIO19 when the output is enabled through DOE31_0 register." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
    </register>
    <register id="GPIOC_DOUT23_20" width="32" offset="0x1214" description="Data output 23 to 20">
        <bitfield id="DIO20" description="This bit sets the value of the pin configured as DIO20 when the output is enabled through DOE31_0 register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO21" description="This bit sets the value of the pin configured as DIO21 when the output is enabled through DOE31_0 register." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO22" description="This bit sets the value of the pin configured as DIO22 when the output is enabled through DOE31_0 register." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO23" description="This bit sets the value of the pin configured as DIO23 when the output is enabled through DOE31_0 register." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
    </register>
    <register id="GPIOC_DOUT27_24" width="32" offset="0x1218" description="Data output 27 to 24">
        <bitfield id="DIO24" description="This bit sets the value of the pin configured as DIO24 when the output is enabled through DOE31_0 register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO25" description="This bit sets the value of the pin configured as DIO25 when the output is enabled through DOE31_0 register." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO26" description="This bit sets the value of the pin configured as DIO26 when the output is enabled through DOE31_0 register." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO27" description="This bit sets the value of the pin configured as DIO27 when the output is enabled through DOE31_0 register." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
    </register>
    <register id="GPIOC_DOUT31_28" width="32" offset="0x121C" description="Data output 31 to 28">
        <bitfield id="DIO28" description="This bit sets the value of the pin configured as DIO28 when the output is enabled through DOE31_0 register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO29" description="This bit sets the value of the pin configured as DIO29 when the output is enabled through DOE31_0 register." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO30" description="This bit sets the value of the pin configured as DIO30 when the output is enabled through DOE31_0 register." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
        <bitfield id="DIO31" description="This bit sets the value of the pin configured as DIO31 when the output is enabled through DOE31_0 register." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
    </register>
