dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/GPIOC_1.0.xml
    <register id="GPIOC_DOUTCLR31_0" width="32" offset="0x12A0" description="Data output clear 31 to 0">
        <bitfield id="DIO0" description="Writing 1 to this bit clears the DIO0 bit in the DOUT31_0 register. Writing 0 has no effect." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO0 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO1" description="Writing 1 to this bit clears the DIO1 bit in the DOUT31_0 register. Writing 0 has no effect." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO1 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO2" description="Writing 1 to this bit clears the DIO2 bit in the DOUT31_0 register. Writing 0 has no effect." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO2 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO3" description="Writing 1 to this bit clears the DIO3 bit in the DOUT31_0 register. Writing 0 has no effect." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO3 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO4" description="Writing 1 to this bit clears the DIO4 bit in the DOUT31_0 register. Writing 0 has no effect." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO4 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO5" description="Writing 1 to this bit clears the DIO5 bit in the DOUT31_0 register. Writing 0 has no effect." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO5 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO6" description="Writing 1 to this bit clears the DIO6 bit in the DOUT31_0 register. Writing 0 has no effect." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO6 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO7" description="Writing 1 to this bit clears the DIO7 bit in the DOUT31_0 register. Writing 0 has no effect." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO7 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO8" description="Writing 1 to this bit clears the DIO8 bit in the DOUT31_0 register. Writing 0 has no effect." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO8 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO9" description="Writing 1 to this bit clears the DIO9 bit in the DOUT31_0 register. Writing 0 has no effect." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO9 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO10" description="Writing 1 to this bit clears the DIO10 bit in the DOUT31_0 register. Writing 0 has no effect." begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO10 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO11" description="Writing 1 to this bit clears the DIO11 bit in the DOUT31_0 register. Writing 0 has no effect." begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO11 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO12" description="Writing 1 to this bit clears the DIO12 bit in the DOUT31_0 register. Writing 0 has no effect." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO12 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO13" description="Writing 1 to this bit clears the DIO13 bit in the DOUT31_0 register. Writing 0 has no effect." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO13 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO14" description="Writing 1 to this bit clears the DIO14 bit in the DOUT31_0 register. Writing 0 has no effect." begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO14 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO15" description="Writing 1 to this bit clears the DIO15 bit in the DOUT31_0 register. Writing 0 has no effect." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO15 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO16" description="Writing 1 to this bit clears the DIO16 bit in the DOUT31_0 register. Writing 0 has no effect." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO16 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO17" description="Writing 1 to this bit clears the DIO17 bit in the DOUT31_0 register. Writing 0 has no effect." begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO17 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO18" description="Writing 1 to this bit clears the DIO18 bit in the DOUT31_0 register. Writing 0 has no effect." begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO18 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO19" description="Writing 1 to this bit clears the DIO19 bit in the DOUT31_0 register. Writing 0 has no effect." begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO19 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO20" description="Writing 1 to this bit clears the DIO20 bit in the DOUT31_0 register. Writing 0 has no effect." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO20 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO21" description="Writing 1 to this bit clears the DIO21 bit in the DOUT31_0 register. Writing 0 has no effect." begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO21 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO22" description="Writing 1 to this bit clears the DIO22 bit in the DOUT31_0 register. Writing 0 has no effect." begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO22 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO23" description="Writing 1 to this bit clears the DIO23 bit in the DOUT31_0 register. Writing 0 has no effect." begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO23 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO24" description="Writing 1 to this bit clears the DIO24 bit in the DOUT31_0 register. Writing 0 has no effect." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO24 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO25" description="Writing 1 to this bit clears the DIO25 bit in the DOUT31_0 register. Writing 0 has no effect." begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO25 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO26" description="Writing 1 to this bit clears the DIO26 bit in the DOUT31_0 register. Writing 0 has no effect." begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO26 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO27" description="Writing 1 to this bit clears the DIO27 bit in the DOUT31_0 register. Writing 0 has no effect." begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO27 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO28" description="Writing 1 to this bit clears the DIO28 bit in the DOUT31_0 register. Writing 0 has no effect." begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO28 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO29" description="Writing 1 to this bit clears the DIO29 bit in the DOUT31_0 register. Writing 0 has no effect." begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO29 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO30" description="Writing 1 to this bit clears the DIO30 bit in the DOUT31_0 register. Writing 0 has no effect." begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO30 in DOUT31_0"/>
        </bitfield>
        <bitfield id="DIO31" description="Writing 1 to this bit clears the DIO31 bit in the DOUT31_0 register. Writing 0 has no effect." begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DIO31 in DOUT31_0"/>
        </bitfield>
    </register>
    <register id="GPIOC_DOUTTGL31_0" width="32" offset="0x12B0" description="Data output toggle 31 to 0">
        <bitfield id="DIO0" description="This bit is used to toggle DIO0 output." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO1" description="This bit is used to toggle DIO1 output." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO2" description="This bit is used to toggle DIO2 output." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO3" description="This bit is used to toggle DIO3 output." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO4" description="This bit is used to toggle DIO4 output." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO5" description="This bit is used to toggle DIO5 output." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO6" description="This bit is used to toggle DIO6 output." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO7" description="This bit is used to toggle DIO7 output." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO8" description="This bit is used to toggle DIO8 output." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO9" description="This bit is used to toggle DIO9 output." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO10" description="This bit is used to toggle DIO10 output." begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO11" description="This bit is used to toggle DIO11 output." begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO12" description="This bit is used to toggle DIO12 output." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO13" description="This bit is used to toggle DIO13 output." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO14" description="This bit is used to toggle DIO14 output." begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO15" description="This bit is used to toggle DIO15 output." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO16" description="This bit is used to toggle DIO16 output." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO17" description="This bit is used to toggle DIO17 output." begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO18" description="This bit is used to toggle DIO18 output." begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO19" description="This bit is used to toggle DIO19 output." begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO20" description="This bit is used to toggle DIO20 output." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO21" description="This bit is used to toggle DIO21 output." begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO22" description="This bit is used to toggle DIO22 output." begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO23" description="This bit is used to toggle DIO23 output." begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO24" description="This bit is used to toggle DIO24 output." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO25" description="This bit is used to toggle DIO25 output." begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO26" description="This bit is used to toggle DIO26 output." begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO27" description="This bit is used to toggle DIO27 output." begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO28" description="This bit is used to toggle DIO28 output." begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO29" description="This bit is used to toggle DIO29 output." begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO30" description="This bit is used to toggle DIO30 output." begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
        <bitfield id="DIO31" description="This bit is used to toggle DIO31 output." begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="TOGGLE" value="0x1" description="Toggle output"/>
        </bitfield>
    </register>
